#Ви маєте три числа, вони вводяться з консолі. Перше число називається fizz, друге називається buzz. До третього необхідно дорахувати від одиниці. Дивлячись на поточне число, якщо воно кратне fizz – треба виводити F замість числа. Якщо число кратне buzz – треба виводити B замість числа. Якщо число кратне і fizz, і buzz, треба виводити FB. Якщо воно не кратне нічому, виводимо число. І так - поки не буде досягнуто третього введеного числа.Приклад умови та результату: Введено числа 2, 5, 18 Висновок має бути таким: 1 F 3 F B F 7 F 9 FB 11 F 13 F B F 17 F

fizz = int(input('Введіть число Fizz\n'))
buzz = int(input('Введіть число Buzz\n'))
x = int(input('Введіть число\n'))
for i in range (1, x + 1):
  if i % fizz and i % buzz:
    print ('FB', end = ' ')
  elif i % fizz:
    print ('F', end = ' ')
  elif i % buzz:
    print ('B', end = ' ')
  elif:
    print (i, end= ' ')
