#Перевірити, чи є введене число парним.
print ("Task 1")
A = int(input('Введіть число: '))
if not A%2:
  print('Число є парним :', A, '\n')
else:
  print ('Число', A,'є непарним ''\n')

#Перевірити, чи є число не парним, ділиться чи на три і на п'ять одночасно, але так, щоб не ділитися на 10.

print ('Task 2')
B = int(input('Введіть число: '))
if B%2 and not B%3 and not B%5:
  print ('Число', B, 'відповідає вимозі''\n')
else: 
  print ('Число', B,'парне, умова порушена \n')

print ('Task 3')
# Ввести число, вивести усі його дільники.
X = int(input('Введіть число: '))
print ('Дільники числа:', end = ' ')
for i in range (1, X+1) :
  if not X%i :
    print(i, end = ' ')

print('\n')
print ('Task 4')
# Ввести число, вивести його розряди та їх множники.
X = int(input('Введіть число: '))
print ('Дільники числа:', end = ' ')
for i in range (1, X+1) :
  if not X%i :
    print(i, end = ' ')

#Ввести число, вивести його розряди та їх множники.
num = int(input('Введіть число: '))
pos = 1 #позиція цифри в введеному числі  

while num > 0: #циклом перебираємо введене число 
  dig = num % 10
  mult = 10 ** pos
  print (f'Позиція:{pos} Розряд:{dig} Множник:{mult}')
  num //= 10 
  pos += 1 